# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge on One-to-Many and Many-to-many relationships!

## Objectives

You will be able to:
- Query data including Many-to-Many relationships
- Write queries that make use of Join Tables

## One-to-Many and Many-to-Many Joins
<img src='Database-Schema.png' width=550>

## Employees and their Office (a One-to-One join)

Return a list of all of the employees with their first name, last name and the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [4]:
import sqlite3
import pandas as pd

In [5]:
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cursor = conn.cursor()

In [30]:
#Your code here
cursor.execute('''
SELECT firstName, lastName, city, state FROM employees
    JOIN offices
    USING(officeCode)
    ORDER BY firstName, lastName;
''')
df = pd.DataFrame(cursor.fetchall())
df.columns = [i[0] for i in cursor.description]
print('Number of results: ', len(df))
df.head()

Number of results:  23

  firstName lastName           city state
0      Andy   Fixter         Sydney
1   Anthony      Bow  San Francisco    CA
2     Barry    Jones         London
3     Diane   Murphy  San Francisco    CA
4  Foon Yue    Tseng            NYC    NY

## Customers and their Orders (a One-to-Many join)

Return a list of all of the customers. For each customer return a record for each of their order numbers, order dates and statuses.

In [33]:
# Your code here
cursor.execute('''
SELECT customerName, orderNumber, orderDate, status FROM customers
    JOIN orders
    USING(customerNumber)
    ORDER BY customerName;
''')#.fetchall()

df = pd.DataFrame(cursor.fetchall())
df.columns = [i[0] for i in cursor.description]
print('Number of results: ', len(df))
df.head()

Number of results:  326

     customerName orderNumber   orderDate   status
0  AV Stores, Co.       10110  2003-03-18  Shipped
1  AV Stores, Co.       10306  2004-10-14  Shipped
2  AV Stores, Co.       10332  2004-11-17  Shipped
3    Alpha Cognac       10136  2003-07-04  Shipped
4    Alpha Cognac       10178  2003-11-08  Shipped

## Orders and their Order Details (another One-to-Many join)

Return a list of orders. For each order return a record for each order detail within the order.

In [34]:
# Your code here
cursor.execute('''
SELECT orderDate, orderNumber, productCode, priceEach, orderLineNumber FROM orders
    JOIN orderdetails
    USING(orderNumber)
    
''')

df = pd.DataFrame(cursor.fetchall())
df.columns = [i[0] for i in cursor.description]
print('Number of results: ', len(df))
df.head()

Number of results:  2996

    orderDate orderNumber productCode priceEach orderLineNumber
0  2003-01-06       10100    S18_1749    136.00               3
1  2003-01-06       10100    S18_2248     55.09               2
2  2003-01-06       10100    S18_4409     75.46               4
3  2003-01-06       10100    S24_3969     35.29               1
4  2003-01-09       10101    S18_2325    108.06               4

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a list of the orders with the the order information, and allthe product information for each product in the order.

In [4]:
# Your code here
cursor.execute('''
SELECT 
''')

## Summary

In this lab, you practiced your knowledge on One-to-Many and Many-to-many relationships!